---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeUserSketchPlaneError
source: html/90e28a35-e861-6b38-3c5b-3ba14db0c5cf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeUserSketchPlaneError Property

Can't change plane of [Element Name] Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotChangeUserSketchPlaneError { get; }
```